Reportcasekaro/statistics.json
{
  "home/apps/sa/verify_cart.js-1,248" : {
    "transaction" : "home/apps/sa/verify_cart.js-1,248",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 162.0,
    "medianResTime" : 162.0,
    "minResTime" : 162.0,
    "maxResTime" : 162.0,
    "pct1ResTime" : 162.0,
    "pct2ResTime" : 162.0,
    "pct3ResTime" : 162.0,
    "throughput" : 6.172839506172839,
    "receivedKBytesPerSec" : 8.987991898148147,
    "sentKBytesPerSec" : 7.233796296296296
  },
  "search/.well-known/shopify/monorail/unstable/produce_batch-1,080" : {
    "transaction" : "search/.well-known/shopify/monorail/unstable/produce_batch-1,080",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 336.0,
    "medianResTime" : 336.0,
    "minResTime" : 336.0,
    "maxResTime" : 336.0,
    "pct1ResTime" : 336.0,
    "pct2ResTime" : 336.0,
    "pct3ResTime" : 336.0,
    "throughput" : 2.976190476190476,
    "receivedKBytesPerSec" : 3.255208333333333,
    "sentKBytesPerSec" : 12.68949962797619
  },
  "search/checkouts/internal/preloads.js-1,056" : {
    "transaction" : "search/checkouts/internal/preloads.js-1,056",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 57.0,
    "medianResTime" : 57.0,
    "minResTime" : 57.0,
    "maxResTime" : 57.0,
    "pct1ResTime" : 57.0,
    "pct2ResTime" : 57.0,
    "pct3ResTime" : 57.0,
    "throughput" : 17.543859649122805,
    "receivedKBytesPerSec" : 34.40241228070175,
    "sentKBytesPerSec" : 22.341008771929825
  },
  "search/.well-known/shopify/monorail/unstable/produce_batch-1,007" : {
    "transaction" : "search/.well-known/shopify/monorail/unstable/produce_batch-1,007",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 349.0,
    "medianResTime" : 349.0,
    "minResTime" : 349.0,
    "maxResTime" : 349.0,
    "pct1ResTime" : 349.0,
    "pct2ResTime" : 349.0,
    "pct3ResTime" : 349.0,
    "throughput" : 2.865329512893983,
    "receivedKBytesPerSec" : 3.150743194842407,
    "sentKBytesPerSec" : 5.095473674785101
  },
  "home/%3Cscript%20src=-1,212" : {
    "transaction" : "home/%3Cscript%20src=-1,212",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 157.0,
    "medianResTime" : 157.0,
    "minResTime" : 157.0,
    "maxResTime" : 157.0,
    "pct1ResTime" : 157.0,
    "pct2ResTime" : 157.0,
    "pct3ResTime" : 157.0,
    "throughput" : 6.369426751592357,
    "receivedKBytesPerSec" : 159.5528960987261,
    "sentKBytesPerSec" : 7.2464669585987265
  },
  "search/.well-known/shopify/monorail/v1/produce-1,041" : {
    "transaction" : "search/.well-known/shopify/monorail/v1/produce-1,041",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 370.0,
    "medianResTime" : 370.0,
    "minResTime" : 370.0,
    "maxResTime" : 370.0,
    "pct1ResTime" : 370.0,
    "pct2ResTime" : 370.0,
    "pct3ResTime" : 370.0,
    "throughput" : 2.7027027027027026,
    "receivedKBytesPerSec" : 2.956081081081081,
    "sentKBytesPerSec" : 24.237225506756758
  },
  "search/.well-known/shopify/monorail/unstable/produce_batch-1,025" : {
    "transaction" : "search/.well-known/shopify/monorail/unstable/produce_batch-1,025",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 324.0,
    "medianResTime" : 324.0,
    "minResTime" : 324.0,
    "maxResTime" : 324.0,
    "pct1ResTime" : 324.0,
    "pct2ResTime" : 324.0,
    "pct3ResTime" : 324.0,
    "throughput" : 3.0864197530864197,
    "receivedKBytesPerSec" : 3.3878279320987654,
    "sentKBytesPerSec" : 9.729456018518519
  },
  "search/.well-known/shopify/monorail/unstable/produce_batch-1,069" : {
    "transaction" : "search/.well-known/shopify/monorail/unstable/produce_batch-1,069",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 327.0,
    "medianResTime" : 327.0,
    "minResTime" : 327.0,
    "maxResTime" : 327.0,
    "pct1ResTime" : 327.0,
    "pct2ResTime" : 327.0,
    "pct3ResTime" : 327.0,
    "throughput" : 3.058103975535168,
    "receivedKBytesPerSec" : 3.34480122324159,
    "sentKBytesPerSec" : 6.907611811926605
  },
  "search/.well-known/shopify/monorail/unstable/produce_batch-1,024" : {
    "transaction" : "search/.well-known/shopify/monorail/unstable/produce_batch-1,024",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 327.0,
    "medianResTime" : 327.0,
    "minResTime" : 327.0,
    "maxResTime" : 327.0,
    "pct1ResTime" : 327.0,
    "pct2ResTime" : 327.0,
    "pct3ResTime" : 327.0,
    "throughput" : 3.058103975535168,
    "receivedKBytesPerSec" : 3.34480122324159,
    "sentKBytesPerSec" : 7.131594036697248
  },
  "search/.well-known/shopify/monorail/unstable/produce_batch-1,046" : {
    "transaction" : "search/.well-known/shopify/monorail/unstable/produce_batch-1,046",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 327.0,
    "medianResTime" : 327.0,
    "minResTime" : 327.0,
    "maxResTime" : 327.0,
    "pct1ResTime" : 327.0,
    "pct2ResTime" : 327.0,
    "pct3ResTime" : 327.0,
    "throughput" : 3.058103975535168,
    "receivedKBytesPerSec" : 3.3507740825688073,
    "sentKBytesPerSec" : 5.492044151376146
  },
  "search/.well-known/shopify/monorail/unstable/produce_batch-1,068" : {
    "transaction" : "search/.well-known/shopify/monorail/unstable/produce_batch-1,068",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 323.0,
    "medianResTime" : 323.0,
    "minResTime" : 323.0,
    "maxResTime" : 323.0,
    "pct1ResTime" : 323.0,
    "pct2ResTime" : 323.0,
    "pct3ResTime" : 323.0,
    "throughput" : 3.0959752321981426,
    "receivedKBytesPerSec" : 3.398316563467492,
    "sentKBytesPerSec" : 4.840484713622291
  },
  "search/apps/sa/verify_cart.js-1,039" : {
    "transaction" : "search/apps/sa/verify_cart.js-1,039",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 156.0,
    "medianResTime" : 156.0,
    "minResTime" : 156.0,
    "maxResTime" : 156.0,
    "pct1ResTime" : 156.0,
    "pct2ResTime" : 156.0,
    "pct3ResTime" : 156.0,
    "throughput" : 6.41025641025641,
    "receivedKBytesPerSec" : 9.346203926282051,
    "sentKBytesPerSec" : 7.512019230769231
  },
  "search/%3Cscript%20src=-1,048" : {
    "transaction" : "search/%3Cscript%20src=-1,048",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 534.0,
    "medianResTime" : 534.0,
    "minResTime" : 534.0,
    "maxResTime" : 534.0,
    "pct1ResTime" : 534.0,
    "pct2ResTime" : 534.0,
    "pct3ResTime" : 534.0,
    "throughput" : 1.8726591760299625,
    "receivedKBytesPerSec" : 47.374253862359545,
    "sentKBytesPerSec" : 2.2585293773408237
  },
  "home/.well-known/shopify/monorail/unstable/produce_batch-1,234" : {
    "transaction" : "home/.well-known/shopify/monorail/unstable/produce_batch-1,234",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 333.0,
    "medianResTime" : 333.0,
    "minResTime" : 333.0,
    "maxResTime" : 333.0,
    "pct1ResTime" : 333.0,
    "pct2ResTime" : 333.0,
    "pct3ResTime" : 333.0,
    "throughput" : 3.003003003003003,
    "receivedKBytesPerSec" : 3.302130255255255,
    "sentKBytesPerSec" : 9.466497747747747
  },
  "home/checkouts/internal/preloads.js-1,219" : {
    "transaction" : "home/checkouts/internal/preloads.js-1,219",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 75.0,
    "medianResTime" : 75.0,
    "minResTime" : 75.0,
    "maxResTime" : 75.0,
    "pct1ResTime" : 75.0,
    "pct2ResTime" : 75.0,
    "pct3ResTime" : 75.0,
    "throughput" : 13.333333333333334,
    "receivedKBytesPerSec" : 26.171875,
    "sentKBytesPerSec" : 16.067708333333336
  },
  "home/.well-known/shopify/monorail/unstable/produce_batch-1,233" : {
    "transaction" : "home/.well-known/shopify/monorail/unstable/produce_batch-1,233",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 320.0,
    "medianResTime" : 320.0,
    "minResTime" : 320.0,
    "maxResTime" : 320.0,
    "pct1ResTime" : 320.0,
    "pct2ResTime" : 320.0,
    "pct3ResTime" : 320.0,
    "throughput" : 3.125,
    "receivedKBytesPerSec" : 3.411865234375,
    "sentKBytesPerSec" : 7.281494140625
  },
  "search/.well-known/shopify/monorail/unstable/produce_batch-1,020" : {
    "transaction" : "search/.well-known/shopify/monorail/unstable/produce_batch-1,020",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 310.0,
    "medianResTime" : 310.0,
    "minResTime" : 310.0,
    "maxResTime" : 310.0,
    "pct1ResTime" : 310.0,
    "pct2ResTime" : 310.0,
    "pct3ResTime" : 310.0,
    "throughput" : 3.225806451612903,
    "receivedKBytesPerSec" : 3.5219254032258065,
    "sentKBytesPerSec" : 6.864289314516129
  },
  "home/.well-known/shopify/monorail/unstable/produce_batch-1,210" : {
    "transaction" : "home/.well-known/shopify/monorail/unstable/produce_batch-1,210",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 317.0,
    "medianResTime" : 317.0,
    "minResTime" : 317.0,
    "maxResTime" : 317.0,
    "pct1ResTime" : 317.0,
    "pct2ResTime" : 317.0,
    "pct3ResTime" : 317.0,
    "throughput" : 3.1545741324921135,
    "receivedKBytesPerSec" : 3.437992902208202,
    "sentKBytesPerSec" : 5.505101537854889
  },
  "search/.well-known/shopify/monorail/unstable/produce_batch-1,092" : {
    "transaction" : "search/.well-known/shopify/monorail/unstable/produce_batch-1,092",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 335.0,
    "medianResTime" : 335.0,
    "minResTime" : 335.0,
    "maxResTime" : 335.0,
    "pct1ResTime" : 335.0,
    "pct2ResTime" : 335.0,
    "pct3ResTime" : 335.0,
    "throughput" : 2.985074626865672,
    "receivedKBytesPerSec" : 3.259095149253731,
    "sentKBytesPerSec" : 18.63339552238806
  },
  "home/.well-known/shopify/monorail/unstable/produce_batch-1,229" : {
    "transaction" : "home/.well-known/shopify/monorail/unstable/produce_batch-1,229",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 334.0,
    "medianResTime" : 334.0,
    "minResTime" : 334.0,
    "maxResTime" : 334.0,
    "pct1ResTime" : 334.0,
    "pct2ResTime" : 334.0,
    "pct3ResTime" : 334.0,
    "throughput" : 2.9940119760479043,
    "receivedKBytesPerSec" : 3.263005239520958,
    "sentKBytesPerSec" : 6.365199288922155
  },
  "home/.well-known/shopify/monorail/unstable/produce_batch-1,228" : {
    "transaction" : "home/.well-known/shopify/monorail/unstable/produce_batch-1,228",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 360.0,
    "medianResTime" : 360.0,
    "minResTime" : 360.0,
    "maxResTime" : 360.0,
    "pct1ResTime" : 360.0,
    "pct2ResTime" : 360.0,
    "pct3ResTime" : 360.0,
    "throughput" : 2.7777777777777777,
    "receivedKBytesPerSec" : 3.0327690972222223,
    "sentKBytesPerSec" : 4.147677951388889
  },
  "search/.well-known/shopify/monorail/v1/produce-1,187" : {
    "transaction" : "search/.well-known/shopify/monorail/v1/produce-1,187",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 711.0,
    "medianResTime" : 711.0,
    "minResTime" : 711.0,
    "maxResTime" : 711.0,
    "pct1ResTime" : 711.0,
    "pct2ResTime" : 711.0,
    "pct3ResTime" : 711.0,
    "throughput" : 1.4064697609001406,
    "receivedKBytesPerSec" : 1.535579289732771,
    "sentKBytesPerSec" : 11.44679588607595
  },
  "home/.well-known/shopify/monorail/v1/produce-1,252" : {
    "transaction" : "home/.well-known/shopify/monorail/v1/produce-1,252",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 371.0,
    "medianResTime" : 371.0,
    "minResTime" : 371.0,
    "maxResTime" : 371.0,
    "pct1ResTime" : 371.0,
    "pct2ResTime" : 371.0,
    "pct3ResTime" : 371.0,
    "throughput" : 2.6954177897574128,
    "receivedKBytesPerSec" : 2.9533776954177897,
    "sentKBytesPerSec" : 24.50355879380054
  },
  "search/%3Cscript%20src=-998" : {
    "transaction" : "search/%3Cscript%20src=-998",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 190.0,
    "medianResTime" : 190.0,
    "minResTime" : 190.0,
    "maxResTime" : 190.0,
    "pct1ResTime" : 190.0,
    "pct2ResTime" : 190.0,
    "pct3ResTime" : 190.0,
    "throughput" : 5.263157894736842,
    "receivedKBytesPerSec" : 131.82051809210526,
    "sentKBytesPerSec" : 6.255139802631579
  },
  "search/.well-known/shopify/monorail/v1/produce-1,103" : {
    "transaction" : "search/.well-known/shopify/monorail/v1/produce-1,103",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 361.0,
    "medianResTime" : 361.0,
    "minResTime" : 361.0,
    "maxResTime" : 361.0,
    "pct1ResTime" : 361.0,
    "pct2ResTime" : 361.0,
    "pct3ResTime" : 361.0,
    "throughput" : 2.770083102493075,
    "receivedKBytesPerSec" : 3.046009349030471,
    "sentKBytesPerSec" : 19.83693299861496
  },
  "home/-1,207" : {
    "transaction" : "home/-1,207",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 196.0,
    "medianResTime" : 196.0,
    "minResTime" : 196.0,
    "maxResTime" : 196.0,
    "pct1ResTime" : 196.0,
    "pct2ResTime" : 196.0,
    "pct3ResTime" : 196.0,
    "throughput" : 5.1020408163265305,
    "receivedKBytesPerSec" : 155.70691167091837,
    "sentKBytesPerSec" : 3.457828443877551
  },
  "search/checkouts/internal/preloads.js-1,002" : {
    "transaction" : "search/checkouts/internal/preloads.js-1,002",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 59.0,
    "medianResTime" : 59.0,
    "minResTime" : 59.0,
    "maxResTime" : 59.0,
    "pct1ResTime" : 59.0,
    "pct2ResTime" : 59.0,
    "pct3ResTime" : 59.0,
    "throughput" : 16.949152542372882,
    "receivedKBytesPerSec" : 33.07070974576271,
    "sentKBytesPerSec" : 21.28575211864407
  },
  "search/.well-known/shopify/monorail/unstable/produce_batch-1,019" : {
    "transaction" : "search/.well-known/shopify/monorail/unstable/produce_batch-1,019",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 319.0,
    "medianResTime" : 319.0,
    "minResTime" : 319.0,
    "maxResTime" : 319.0,
    "pct1ResTime" : 319.0,
    "pct2ResTime" : 319.0,
    "pct3ResTime" : 319.0,
    "throughput" : 3.134796238244514,
    "receivedKBytesPerSec" : 3.422560736677116,
    "sentKBytesPerSec" : 4.686887735109718
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 34,
    "errorCount" : 4,
    "errorPct" : 11.764706,
    "meanResTime" : 304.0,
    "medianResTime" : 327.0,
    "minResTime" : 57.0,
    "maxResTime" : 711.0,
    "pct1ResTime" : 370.5,
    "pct2ResTime" : 578.25,
    "pct3ResTime" : 711.0,
    "throughput" : 3.2483041941339446,
    "receivedKBytesPerSec" : 16.200469332186874,
    "sentKBytesPerSec" : 9.355948307776822
  },
  "search/apps/sa/verify_cart.js-1,101" : {
    "transaction" : "search/apps/sa/verify_cart.js-1,101",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 340.0,
    "medianResTime" : 340.0,
    "minResTime" : 340.0,
    "maxResTime" : 340.0,
    "pct1ResTime" : 340.0,
    "pct2ResTime" : 340.0,
    "pct3ResTime" : 340.0,
    "throughput" : 2.941176470588235,
    "receivedKBytesPerSec" : 4.696116727941176,
    "sentKBytesPerSec" : 3.5989200367647056
  },
  "search/search-1,043" : {
    "transaction" : "search/search-1,043",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 280.0,
    "medianResTime" : 280.0,
    "minResTime" : 280.0,
    "maxResTime" : 280.0,
    "pct1ResTime" : 280.0,
    "pct2ResTime" : 280.0,
    "pct3ResTime" : 280.0,
    "throughput" : 3.571428571428571,
    "receivedKBytesPerSec" : 100.38713727678571,
    "sentKBytesPerSec" : 4.711914062499999
  },
  "search/.well-known/shopify/monorail/unstable/produce_batch-1,079" : {
    "transaction" : "search/.well-known/shopify/monorail/unstable/produce_batch-1,079",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 335.0,
    "medianResTime" : 335.0,
    "minResTime" : 335.0,
    "maxResTime" : 335.0,
    "pct1ResTime" : 335.0,
    "pct2ResTime" : 335.0,
    "pct3ResTime" : 335.0,
    "throughput" : 2.985074626865672,
    "receivedKBytesPerSec" : 3.259095149253731,
    "sentKBytesPerSec" : 7.144939365671641
  },
  "search/.well-known/shopify/monorail/unstable/produce_batch-1,033" : {
    "transaction" : "search/.well-known/shopify/monorail/unstable/produce_batch-1,033",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 345.0,
    "medianResTime" : 345.0,
    "minResTime" : 345.0,
    "maxResTime" : 345.0,
    "pct1ResTime" : 345.0,
    "pct2ResTime" : 345.0,
    "pct3ResTime" : 345.0,
    "throughput" : 2.898550724637681,
    "receivedKBytesPerSec" : 3.175951086956522,
    "sentKBytesPerSec" : 13.094429347826088
  },
  "home/.well-known/shopify/monorail/unstable/produce_batch-1,245" : {
    "transaction" : "home/.well-known/shopify/monorail/unstable/produce_batch-1,245",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 350.0,
    "medianResTime" : 350.0,
    "minResTime" : 350.0,
    "maxResTime" : 350.0,
    "pct1ResTime" : 350.0,
    "pct2ResTime" : 350.0,
    "pct3ResTime" : 350.0,
    "throughput" : 2.857142857142857,
    "receivedKBytesPerSec" : 3.1361607142857144,
    "sentKBytesPerSec" : 12.907366071428573
  },
  "search/.well-known/shopify/monorail/unstable/produce_batch-1,075" : {
    "transaction" : "search/.well-known/shopify/monorail/unstable/produce_batch-1,075",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 346.0,
    "medianResTime" : 346.0,
    "minResTime" : 346.0,
    "maxResTime" : 346.0,
    "pct1ResTime" : 346.0,
    "pct2ResTime" : 346.0,
    "pct3ResTime" : 346.0,
    "throughput" : 2.890173410404624,
    "receivedKBytesPerSec" : 3.1441925578034686,
    "sentKBytesPerSec" : 7.092779082369943
  }
}