linkedinReports3/statistics.json
{
  "Home PageHTTP Request" : {
    "transaction" : "Home PageHTTP Request",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1497.6,
    "medianResTime" : 1415.0,
    "minResTime" : 1352.0,
    "maxResTime" : 1881.0,
    "pct1ResTime" : 1881.0,
    "pct2ResTime" : 1881.0,
    "pct3ResTime" : 1881.0,
    "throughput" : 0.2894356005788712,
    "receivedKBytesPerSec" : 38.286111613603474,
    "sentKBytesPerSec" : 0.06727116497829233
  },
  "Home PageHTTP Request-0" : {
    "transaction" : "Home PageHTTP Request-0",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 373.0,
    "medianResTime" : 322.0,
    "minResTime" : 251.0,
    "maxResTime" : 712.0,
    "pct1ResTime" : 712.0,
    "pct2ResTime" : 712.0,
    "pct3ResTime" : 712.0,
    "throughput" : 0.31026993484331367,
    "receivedKBytesPerSec" : 0.11089726186782502,
    "sentKBytesPerSec" : 0.035450764039714554
  },
  "Invalid Page HTTP Request-0" : {
    "transaction" : "Invalid Page HTTP Request-0",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 241.0,
    "medianResTime" : 228.0,
    "minResTime" : 224.0,
    "maxResTime" : 266.0,
    "pct1ResTime" : 266.0,
    "pct2ResTime" : 266.0,
    "pct3ResTime" : 266.0,
    "throughput" : 0.32030749519538754,
    "receivedKBytesPerSec" : 0.11948971012171686,
    "sentKBytesPerSec" : 0.10166009368994235
  },
  "Home PageHTTP Request-1" : {
    "transaction" : "Home PageHTTP Request-1",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1121.8,
    "medianResTime" : 1158.0,
    "minResTime" : 1025.0,
    "maxResTime" : 1211.0,
    "pct1ResTime" : 1211.0,
    "pct2ResTime" : 1211.0,
    "pct3ResTime" : 1211.0,
    "throughput" : 0.3019688368160406,
    "receivedKBytesPerSec" : 39.83605923118734,
    "sentKBytesPerSec" : 0.03568186450658292
  },
  "Invalid Page HTTP Request-1" : {
    "transaction" : "Invalid Page HTTP Request-1",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 1145.2,
    "medianResTime" : 1108.0,
    "minResTime" : 1063.0,
    "maxResTime" : 1295.0,
    "pct1ResTime" : 1295.0,
    "pct2ResTime" : 1295.0,
    "pct3ResTime" : 1295.0,
    "throughput" : 0.30310378273520855,
    "receivedKBytesPerSec" : 95.57122749454415,
    "sentKBytesPerSec" : 0.13704790176406403
  },
  "Invalid Page HTTP Request" : {
    "transaction" : "Invalid Page HTTP Request",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 1387.0,
    "medianResTime" : 1336.0,
    "minResTime" : 1330.0,
    "maxResTime" : 1557.0,
    "pct1ResTime" : 1557.0,
    "pct2ResTime" : 1557.0,
    "pct3ResTime" : 1557.0,
    "throughput" : 0.29827596492274655,
    "receivedKBytesPerSec" : 94.16024596581757,
    "sentKBytesPerSec" : 0.22953267613195727
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 35,
    "errorCount" : 15,
    "errorPct" : 42.857143,
    "meanResTime" : 890.7714285714285,
    "medianResTime" : 1063.0,
    "minResTime" : 224.0,
    "maxResTime" : 1881.0,
    "pct1ResTime" : 1434.6,
    "pct2ResTime" : 1621.7999999999986,
    "pct3ResTime" : 1881.0,
    "throughput" : 1.8332285774146238,
    "receivedKBytesPerSec" : 241.10751149041485,
    "sentKBytesPerSec" : 0.630939578750262
  },
  "Forgot HTTP Request" : {
    "transaction" : "Forgot HTTP Request",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 469.8,
    "medianResTime" : 441.0,
    "minResTime" : 434.0,
    "maxResTime" : 519.0,
    "pct1ResTime" : 519.0,
    "pct2ResTime" : 519.0,
    "pct3ResTime" : 519.0,
    "throughput" : 0.31515915537346356,
    "receivedKBytesPerSec" : 7.79218700756382,
    "sentKBytesPerSec" : 0.12772563425780017
  }
}